Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The source ``local.conf.sample`` file used depends on the :term:`TEMPLATECONF` script variable, which defaults to :oecore_path:`meta/conf/templates/default` in :term:`OpenEmbedded-Core (OE-Core)`. Because the script variable points to the source of the ``local.conf.sample`` file, this implies that you can configure your build environment from any layer by setting the variable in the top-level build environment setup script as follows::
it_it: Il file sorgente ``local.conf.sample`` utilizzato dipende dalla variabile di script :term:`TEMPLATECONF`, che per default è :oecore_path:`meta/conf/templates/default` in :term:`OpenEmbedded-Core (OE-Core)`. Poiché la variabile di script punta al file sorgente ``local.conf.sample``, ciò implica che è possibile configurare l'ambiente di compilazione da qualsiasi layer impostando la variabile nello script di configurazione dell'ambiente di compilazione di livello superiore in questo modo::

source: The sources for the kernel are stored under ``tmp/pkgdata/<MACHINE>/debugsources/linux-yocto-debugsources.json.zstd``. In order to include the information into the :term:`SPDX` file to filter out source files that are not used to compile the kernel, add the following in a :term:`configuration file`::
it_it: I sorgenti del kernel sono memorizzati in ``tmp/pkgdata/<MACHINE>/debugsources/linux-yocto-debugsources.json.zstd``. Per includere le informazioni nel file :term:`SPDX` e filtrare i file sorgente non utilizzati per la compilazione del kernel, aggiungere quanto segue in un :term:`configuration file`::

source: The specific form of this output is a set of files that includes a self-extracting SDK installer (``*.sh``), host and target manifest files, and files used for SDK testing. When the SDK installer file is run, it installs the SDK. The SDK consists of a cross-development toolchain, a set of libraries and headers, and an SDK environment setup script. Running this installer essentially sets up your cross-development environment. You can think of the cross-toolchain as the "host" part because it runs on the SDK machine. You can think of the libraries and headers as the "target" part because they are built for the target hardware. The environment setup script is added so that you can initialize the environment before using the tools.
it_it: Nella sua forma specifica, questo output è un insieme di file che include un programma di installazione autoestraente dell'SDK (``*.sh``), file manifest per host e target e file utilizzati per il test dell'SDK. Quando si esegue il file di installazione dell'SDK, questo installa l'SDK. L'SDK è composto da una toolchain di sviluppo ctoss-sviluppo, un insieme di librerie e file di header e uno script di configurazione dell'ambiente SDK. L'esecuzione di questo programma di installazione configura essenzialmente l'ambiente di sviluppo cross-sviluppo. È possibile considerare la toolchain cross-development come la parte "host", poiché viene eseguita sulla macchina SDK. Le librerie e i file di header possono essere considerati come la parte "target", poiché sono compilati per l'hardware target. Lo script di configurazione dell'ambiente viene aggiunto per consentire l'inizializzazione dell'ambiente prima di utilizzare i tool.

source: The stable point upgrade mechanism uses a *filter regex* to constrain the upstream version check so that only versions within the same stable series are considered. When a recipe sets :term:`UPSTREAM_STABLE_RELEASE_REGEX`, the version-checking infrastructure in BitBake's fetchers (git, wget, crate) applies that regex to filter discovered upstream versions. Only versions matching the regex are considered as upgrade candidates.
it_it: Il meccanismo di aggiornamento a punto stabile utilizza un *filter regex* [espressione regolare di filtro] per limitare il controllo della versione upstream, in modo che vengano considerate solo le versioni appartenenti alla stessa serie stabile. Quando una ricetta imposta :term:`UPSTREAM_STABLE_RELEASE_REGEX`, l'infrastruttura di controllo della versione nei fetcher di BitBake (git, wget, crate) applica tale espressione regolare per filtrare le versioni upstream rilevate. Solo le versioni che corrispondono all'espressione regolare vengono considerate come potenziali aggiornamenti.

source: The stamp mechanism is more general than the shared state (sstate) cache mechanism described in the ":ref:`overview-manual/concepts:setscene tasks and shared state`" section. BitBake avoids rerunning any task that has a valid stamp file, not just tasks that can be accelerated through the sstate cache.
it_it: Il meccanismo degli stamp [timbratura] è più generale del meccanismo di cache dello shared state (sstate) descritto nella sezione ":ref:`overview-manual/concepts:setscene tasks and shared state`". BitBake evita di rieseguire qualsiasi task che disponga di un file di timbratura valido, non solo i task che possono essere accelerati tramite la cache sstate.

source: The statements in this file define:
it_it: Le istruzioni in questo file definiscono:

source: The string "meta-" is prepended to the machine or platform name, which is "bsp_root_name" in the above form.
it_it: La stringa "meta-" viene anteposta al nome della macchina o della piattaforma, che nella forma sopra riportata è "bsp_root_name".

source: The syntax for a SPDX License Expression is defined in the `SPDX Specification <https://spdx.github.io/spdx-spec/v3.0.1/annexes/spdx-license-expressions/>`__.
it_it: La sintassi per un'espressione di licenza SPDX è definita nella `Specifica SPDX <https://spdx.github.io/spdx-spec/v3.0.1/annexes/spdx-license-expressions/>`__.

source: The system used to build images in a Yocto Project Development environment. The build system is sometimes referred to as the development host.
it_it: Il sistema utilizzato per creare immagini in un Ambiente di Aviluppo di Yocto Project. Il sistema di compilazione viene talvolta chiamato "Host di Sviluppo" o "Build Host".

source: The task executor and scheduler used by the OpenEmbedded build system to build images. For more information on BitBake, see the :doc:`BitBake User Manual <bitbake:index>`.
it_it: L'esecutore e lo scheduler di task utilizzati dal sistema di build OpenEmbedded per creare le immagini. Per ulteriori informazioni su BitBake, consultare il :doc:`Manuale Utente di BitBake <bitbake:index>`.

source: The term "package" is sometimes used to refer to recipes. However, since the word "package" is used for the packaged output from the OpenEmbedded build system (i.e. ``.ipk``, ``.deb`` or ``.rpm`` files), this document avoids using the term "package" when referring to recipes.
it_it: Il termine "package" [pacchetto] viene talvolta utilizzato per riferirsi alle ricette. Tuttavia, poiché il termine "package" viene utilizzato per indicare l'output impacchettato dal sistema di build OpenEmbedded (ovvero i file ``.ipk``, ``.deb`` o ``.rpm``), in questo documento si evita di utilizzare il termine "package" quando ci si riferisce alle ricette.

source: The term "primary" means that dedicated builds for these architectures or features are being run on a daily basis on the Yocto Project Autobuilder and also tested with incoming changes before they merge. These changes are usually on the "-next" Git branches of the :term:`OpenEmbedded-Core (OE-Core)` repositories.
it_it: Il termine "primario" indica che per queste architetture o funzionalità vengono eseguite quotidianamente build dedicate sull'Autobuilder di Yocto Project e che queste vengono testate con le modifiche in arrivo prima di essere integrate. Tali modifiche si trovano solitamente sui branch Git "-next" dei repository :term:`OpenEmbedded-Core (OE-Core)`.

source: The term "secondary" means that in some cases there is code/feature/support which is desired by people using the project and is in the project's interests to support, however there isn't wide enough interest and support to justify testing all incoming changes on it. There are however project member organisations and maintainers willing to run tests and review fixes.
it_it: Il termine "secondario" indica che, in alcuni casi, esiste del codice/funzionalità/supporto desiderato dagli utenti del progetto e che è nell'interesse del progetto stesso supportare, tuttavia non vi è un interesse e un supporto sufficientemente ampi da giustificare il test di tutte le modifiche in arrivo. Esistono comunque organizzazioni membri del progetto e manutentori disposti a eseguire test e revisionare le correzioni.

source: The time span between milestone releases can vary, but they are in general evenly spaced out during this six-months period of time.
it_it: L'intervallo di tempo tra le release milestone può variare, ma in genere sono distribuite uniformemente durante questo periodo di sei mesi.

source: The tool is pretty self-explanatory, but for more detailed information on navigating through the data, see the `KernelShark website <https://kernelshark.org/Documentation.html>`__.
it_it: Il tool è abbastanza intuitivo, ma per informazioni più dettagliate su come navigare tra i dati, consultate il `sito web di KernelShark <https://kernelshark.org/Documentation.html>`__.

source: The tools presented are, for the most part, completely open-ended and have quite good and/or extensive documentation of their own which can be used to solve just about any problem you might come across in Linux. Each section that describes a particular tool has links to that tool's documentation and website.
it_it: I tool presentati sono, per la maggior parte, completamente aperti e dispongono di una documentazione completa e/o esaustiva che può essere utilizzata per risolvere praticamente qualsiasi problema si possa incontrare in Linux. Ogni sezione che descrive un tool specifico contiene link alla relativa documentazione e al sito web.

source: The top-level :manpage:`perf(1) manual page <perf(1)>`.
it_it: Il livello superiore :manpage:`perf(1) manual page <perf(1)>`.

source: The trace events subsystem accommodate static and dynamic tracepoints in exactly the same way --- there's no difference as far as the infrastructure is concerned. See the ftrace section for more details on the trace event subsystem.
it_it: Il sottosistema degli eventi di traccia gestisce i tracepoint statici e dinamici esattamente allo stesso modo: non c'è alcuna differenza per quanto riguarda l'infrastruttura interessata. Per maggiori dettagli sul sottosistema degli eventi di traccia, consultare la sezione ftrace.

source: The tracing and profiling infrastructure in Linux has become unified in a way that allows us to use the same tool with a completely different set of counters, not just the standard hardware counters that traditional tools have had to restrict themselves to (the traditional tools can now actually make use of the expanded possibilities now available to them, and in some cases have, as mentioned previously).
it_it: L'infrastruttura di tracing e profilazione in Linux si è unificata in modo tale da consentirci di utilizzare lo stesso strumento con un set di contatori completamente diverso, non solo con i contatori hardware standard a cui gli strumenti tradizionali erano costretti a limitarsi (gli strumenti tradizionali ora possono effettivamente sfruttare le maggiori possibilità a loro disposizione e, in alcuni casi, lo hanno già fatto, come accennato in precedenza).

source: The upstream is no longer available. This typically means a defunct project where no activity has happened for a long time --- measured in years. To make that judgement, it is recommended to look at not only when the last release happened, but also when the last commit happened, and whether newly made bug reports and merge requests since that time receive no reaction. It is also recommended to add to the patch description any relevant links where the inactivity can be clearly seen.
it_it: Il progetto upstream non è più disponibile. In genere si tratta di un progetto abbandonato, inattivo da molto tempo, anche in anni. Per valutare la situazione, si consiglia di verificare non solo la data dell'ultima release, ma anche la data dell'ultimo commit e se le segnalazioni di bug e le richieste di merge effettuate da allora non hanno ricevuto risposta. Si consiglia inoltre di aggiungere alla descrizione della patch eventuali link pertinenti che mostrino chiaramente l'inattività.

source: The use of the "%" character is limited in that it only works directly in front of the .bbappend portion of the append file's name. You cannot use the wildcard character in any other location of the name.
it_it: L'uso del carattere "%" è limitato al fatto che funziona solo direttamente prima della parte .bbappend del nome del file di append. Non è possibile utilizzare il carattere jolly in nessun'altra posizione del nome.

source: The variable supports using vendor and product names like this::
it_it: La variabile supporta l'utilizzo di nomi di fornitori e prodotti come segue::

source: The variables used in this file configure the layer. A good way to learn about layer configuration files is to examine various files for BSP from the :yocto_git:`Source Repositories <>`.
it_it: Le variabili utilizzate in questo file configurano il layer. Un buon modo per imparare a conoscere i file di configurazione dei layer è esaminare i vari file BSP presenti nei repository sorgente di :yocto_git:`Source Repositories <>`.

source: The variables used to configure the machine define machine-specific properties; for example, machine-dependent packages, machine tunings, the type of kernel to build, and U-Boot configurations.
it_it: Le variabili utilizzate per configurare la macchina definiscono proprietà specifiche della macchina; ad esempio, pacchetti dipendenti dalla macchina, ottimizzazioni della macchina, il tipo di kernel da compilare e configurazioni di U-Boot.

source: The work of the Security Team might require high confidentiality. Team members are individuals selected by merit and do not represent the companies they work for. They do not share information about confidential issues outside of the team and do not hint about ongoing embargoes.
it_it: Il lavoro del Security Team potrebbe richiedere un elevato livello di riservatezza. I membri del team sono individui selezionati in base al merito e non rappresentano le aziende per cui lavorano. Non condividono informazioni riservate al di fuori del team e non accennano a embarghi in corso.

source: Then open up the ``Capture`` dialog by choosing from the KernelShark menu::
it_it: Quindi si apre la finestra di dialogo ``Capture`` selezionandola dal menu di KernelShark::

source: Then the CVE information will automatically be added in the ``cve-check`` or :ref:`ref-classes-vex` report.
it_it: A questo punto, le informazioni CVE verranno aggiunte automaticamente al report ``cve-check`` o :ref:`ref-classes-vex`.

source: Then, create a new branch in your local Git repository for your changes, starting from the reference branch in the upstream repository (often called ``master``)::
it_it: Poi, si crea un nuovo branch nel proprio repository Git locale per le modifiche, partendo dal branch di riferimento nel repository upstream (spesso chiamato ``master``)::

source: Then, generate the :term:`CVE_STATUS` information for the desired version of the kernel:
it_it: Successivamente, generare le informazioni :term:`CVE_STATUS` per la versione desiderata del kernel:

source: Then, review each subject line and list of recipients carefully, and then allow the command to send each message.
it_it: Successivamente, rivedere attentamente ogni riga dell'oggetto e l'elenco dei destinatari, quindi consentire al comando di inviare ogni messaggio.

source: Then, run the task again:
it_it: Quindi, eseguiamo nuovamente il task:

source: Then, the new mapping between the new task hash and its output hash will be reported to the Hash Equivalence server. The server will let BitBake know whether this output hash is the same as a previously reported output hash, for a different task hash.
it_it: Successivamente, la nuova mappatura tra il nuovo hash del task e il suo hash di output verrà segnalata al server di Hash Equivalence. Il server comunicherà a BitBake se l'hash di output corrisponde a un hash di output precedentemente segnalato, relativo a un hash di task diverso.

source: Then, you need to set a name and e-mail address that Git will use to identify your commits::
it_it: Successivamente, è necessario impostare un nome e un indirizzo e-mail che Git utilizzerà per identificare i commit::

source: Then, you should also add an ``Upstream-Status:`` tag containing one of the following status strings:
it_it: Si dovrebbe anche aggiungere un tag ``Upstream-Status:`` ` contenente una delle seguenti stringhe di stato:

source: There are four hardware reference BSPs in the Yocto Project release, located in the :yocto_git:`meta-yocto-bsp </meta-yocto/tree/meta-yocto-bsp>` BSP layer:
it_it: Nella release di Yocto Project sono presenti quattro BSP di riferimento hardware, situati nel layer BSP :yocto_git:`meta-yocto-bsp </meta-yocto/tree/meta-yocto-bsp>`:

source: There are general considerations that help you create more secure images. You should consider the following suggestions to make your device more secure:
it_it: Esistono considerazioni generali che possono aiutare a creare immagini più sicure. Per rendere il dispositivo più sicuro, si devono tenere in considerazione i seguenti suggerimenti:

source: There are layers in the Yocto Project Source Repositories that cannot be found in the OpenEmbedded Layer Index. Such layers are either deprecated or experimental in nature.
it_it: Nei Repository del Codice Sorgente di Yocto Project sono presenti layer che non si trovano nell'indice dei layer di OpenEmbedded. Tali layer sono obsoleti o sperimentali.

source: There are many ``MACHINE*`` variables that help you configure a particular piece of hardware.
it_it: Esistono numerose variabili ``MACHINE*`` che consentono di configurare un particolare componente hardware.

source: There are many layers working in the Yocto Project development environment. The :yocto_home:`Yocto Project Compatible Layer Index </software-overview/layers/>` and :oe_layerindex:`OpenEmbedded Layer Index <>` both contain layers from which you can use or leverage.
it_it: Nell'ambiente di sviluppo di Yocto Project sono presenti numerosi layer. Lo :yocto_home:`Yocto Project Compatible Layer Index </software-overview/layers/>` e :oe_layerindex:`OpenEmbedded Layer Index <>` contengono entrambi layer utilizzabili o sfruttabili.

source: There are no guarantees about if or when a bug might be worked on since an open-source project has no dedicated engineering resources. However, the project does have a good track record of resolving common issues over the medium and long term. We do encourage people to file bugs so issues are at least known about. It helps other users when they find somebody having the same issue as they do, and an issue that is unknown is much less likely to ever be fixed!
it_it: Non vi è alcuna garanzia che un bug venga risolto o meno, poiché un progetto open source non dispone di risorse di sviluppo dedicate. Tuttavia, il progetto ha una buona reputazione per quanto riguarda la risoluzione dei problemi comuni a medio e lungo termine. Incoraggiamo gli utenti a segnalare i bug in modo che i problemi siano almeno noti. Questo aiuta gli altri utenti quando trovano qualcuno che ha riscontrato lo stesso problema, e un problema sconosciuto ha molte meno probabilità di essere risolto!

source: There are other directories generated within :term:`WORKDIR`. The most important directory is ``WORKDIR/temp/``, which has log files for each task (``log.do_*.pid``) and contains the scripts BitBake runs for each task (``run.do_*.pid``). The ``WORKDIR/image/`` directory is where "make install" places its output that is then split into sub-packages within ``WORKDIR/packages-split/``.
it_it: Vengono generate altre directory all'interno di :term:`WORKDIR`. La directory più importante è ``WORKDIR/temp/``, che contiene i file di log per ogni attività (``log.do_*.pid``) e gli script che BitBake esegue per ogni task (``run.do_*.pid``). La directory ``WORKDIR/image/`` è quella in cui il comando "make install" inserisce il suo output, che viene poi suddiviso in sottocartelle all'interno di ``WORKDIR/packages-split/``.

source: There are some cases where ordering is important and these cases would override this default order. Examples include:
it_it: In alcuni casi, l'ordine è importante e in questi casi l'ordine di default viene sovrascritto. Ad esempio:

source: There are two different methods within the OpenEmbedded build system to satisfy the licensing requirements for an encumbered BSP. The following list describes them in order of preference:
it_it: Nel sistema di build di OpenEmbedded esistono due metodi diversi per soddisfare i requisiti di licenza per un BSP gravato da vincoli. Il seguente elenco li descrive in ordine di preferenza:

source: There are two kinds of mirrors: pre-mirrors and regular mirrors. The :term:`PREMIRRORS` and :term:`MIRRORS` variables point to these, respectively. BitBake checks pre-mirrors before looking upstream for any source files. Pre-mirrors are appropriate when you have a shared directory that is not a directory defined by the :term:`DL_DIR` variable. A Pre-mirror typically points to a shared directory that is local to your organization.
it_it: Esistono due tipi di mirror: pre-mirror e mirror standard. Le variabili :term:`PREMIRRORS` e :term:`MIRRORS` puntano rispettivamente a questi due tipi. BitBake controlla i pre-mirror prima di cercare i file sorgente nel repository principale. I pre-mirror sono appropriati quando si dispone di una directory condivisa che non è definita dalla variabile :term:`DL_DIR`. Un pre-mirror in genere punta a una directory condivisa locale all'organizzazione.

source: There are two ways of setting up the :term:`Poky` reference distro:
it_it: Esistono due modi per configurare la distribuzione di riferimento :term:`Poky`:

source: There doesn't seem to be any documentation for Sysprof, but maybe that's because it's pretty self-explanatory. The Sysprof website, however, is here: `Sysprof, System-wide Performance Profiler for Linux <http://sysprof.com/>`__
it_it: Non sembra esserci alcuna documentazione per Sysprof, ma forse è perché è piuttosto intuitivo. Il sito web di Sysprof, tuttavia, è questo: `Sysprof, System-wide Performance Profiler for Linux <http://sysprof.com/>`__

source: There is a clear documented group of maintainers agreeing to maintain it.
it_it: Esiste un gruppo chiaramente documentato di manutentori che si impegnano a mantenerlo.

source: There is a somewhat formal method by which developers commit changes and push them into the "contrib" area and subsequently request that the maintainer include them into an upstream branch. This process is called "submitting a patch" or "submitting a change." For information on submitting patches and changes, see the ":doc:`/contributor-guide/submit-changes`" section in the Yocto Project and OpenEmbedded Contributor Guide.
it_it: Esiste un metodo piuttosto formale con cui gli sviluppatori effettuano il commit delle modifiche e le inviano [push] all'area "contrib", per poi richiedere al manutentore di includerle in un branch upstream. Questo processo è chiamato "submitting a patch" [invio di una patch] o "submitting a change" [invio di una modifica]. Per informazioni sull'invio di patch e modifiche, consultare la sezione ":doc:`/contributor-guide/submit-changes`" nella Guida per i Collaboratori di Yocto Project e di OpenEmbedded.
